jayis1/daily-ideas/systems/soc-devices/scribe-nib/firmware/sdkconfig.defaults
# Scribe Nib — ESP32-S3 SDK configuration defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU frequency
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# BLE
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BTDM_MODEM_SLEEP=y
CONFIG_BLE_HID_ENABLED=y

# Power management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_PM_PROFILING=y

# SPI
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# I2C
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# Touch
CONFIG_TOUCH_PAD_ISR_IN_IRAM=y

# Deep sleep
CONFIG_ESP32S3_DEEP_SLEEP_WAKEUP_DELAY=2000

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (not used — keep disabled for power savings)
CONFIG_ESP32S3_SPIRAM_SUPPORT=n

# UART
CONFIG_UART_ISR_IN_IRAM=y

# LEDC (PWM for vibration motor)
CONFIG_LEDC_ENABLE_DEBUG_LOG=n

# Watchdog — disable for development
CONFIG_ESP_TASK_WDT=n

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# OTA (future)
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=n